---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceCutout
source: html/bfa7177a-e206-0223-fd30-140b690071dc.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceCutout Property

The property labeled "Image" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public static string SurfaceCutout { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.